{
  "typed": {
    "t1": "Aventurier.",
    "t2": "Passionné de technologie.",
    "t3": "Aspirant développeur blockchain.",
    "t4": "Ouvert à l'apprentissage de nouvelles technologies.",
    "t5": "Développeur front-end."
  },
  "homePage": {
    "greet": "Salut je suis ",
    "aboutText": "À propos",
    "heroText": "Bonjour, je suis développeur frontend, concepteur de logo et éditeur de photos à Jos, au Nigeria. Désireux d'élargir ses connaissances et ses compétences",
    "exploreBtn": "Explorer"
  },

  "nav": {
    "home": "Maison",
    "resume": "CV",
    "works": "Travaux",
    "about": "À propos",
    "tools": "Outils"
  },

  "aboutPage": {
    "description": "Salut,",
    "brief": "Je m'appelle Victor Umeokoli ou Umeh pour une courte période de vie à Jos, dans l'État du plateau du Nigeria.",
    "skills": "Je suis un développeur frontend, un concepteur de logos et de vecteurs et un aspirant développeur blockchain.",
    "hobby": "Loisirs",
    "hobbyDesc": "J'aime faire de la randonnée, lire des livres de fiction et des bandes dessinées, apprendre de nouvelles choses qui m'intéressent ou qui sont pour le travail. Pendant mon temps libre, je regarde du football ou des animes.",
    "skillsList": "Mes compétences techniques et les outils avec lesquels je travaille sont HTML, CSS, tailwindcss, SASS, styled-components, git, Javascript, Typescript, Figma, Adobe XD, Photoshop, Illustrator, Lightroom et autres ......."
  },

  "resumePage": {
    "header": "CV",
    "address": {
      "1": "Victor Onyeka Umeokoli",
      "2": "Jos, plateau state. Nigeria",
      "3": "victorumeh196@gmail.com",
      "4": "(+234) 8087411750"
    },
    "objective": {
      "header": "Objectif",
      "body": "Développeur frontend dévoué et passionné, créant des applications Web attrayantes, interactives et centrées sur l'utilisateur. Adepte de la traduction de conceptions UI/UX en interfaces fonctionnelles et réactives tout en restant à jour avec les dernières tendances et technologies de développement Web. À la recherche d'un rôle de développement front-end de niveau junior dans une entreprise technologique avant-gardiste."
    },
    "experience": {
      "header": "Expérience professionnelle",
      "section1": {
        "comp": "Studios numériques Amono",
        "role": "Éditeur de photos et imprimante",
        "text": "Une entreprise d'impression photo fournissant des services d'impression numérique, d'agrandissement et d'impression de photos aux photographes et aux particuliers à Jos, dans l'État du plateau du Nigeria. Juin 2018 - décembre 2020"
      },
      "section2": {
        "comp": "Monde de la photo",
        "role": "Éditeur de photos et imprimeur senior",
        "text": "Janvier 2021 - février 2022 Un studio de photographie et une entreprise d'impression photo fournissant des services numériques, de séance photo, d'agrandissement de photos et d'impression pour les photographes et les particuliers à Jos, dans l'État du plateau du Nigeria."
      }
    },
    "education": {
      "header": "Éducation",
      "details": {
        "1": "École secondaire modèle Trinity - Anambra - janvier 2012 - décembre 2013",
        "2": "École secondaire St Stephen - Anambra - janvier 2014 - décembre 2015",
        "3": "Nouvelle école polyvalente Dominion - Plateau - juin 2015 - décembre 2017"
      }
    },
    "skills": {
      "softSkills": {
        "header": "Compétences générales",
        "skills": [
          "Compétences personnelles",
          "Attention au détail",
          "Résolution de problème",
          "Communication",
          "Travail en équipe",
          "Adaptabilité"
        ]
      },
      "hardSkills": {
        "header": "Compétences difficiles",
        "skills": [
          "HTML",
          "CSS",
          "Conception réactive",
          "Tailwindcss",
          "SASS",
          "MUI",
          "Styled Components",
          "Javascript",
          "Typescript",
          "React",
          "Redux",
          "API de contexte",
          "FIgma",
          "Adobe XD",
          "Git",
          "Github",
          "Adobe Photoshop"
        ]
      }
    }
  },
  "toolsPage": {
    "header": "Voici quelques-uns des outils que j'utilise pour concevoir, optimiser des images et développer.",
    "frontend": [
      {
        "name": "HTML",
        "description": "HTML est ma pierre angulaire en tant que développeur frontend. Avec lui, je crée des expériences Web captivantes, structure le contenu et assure l'accessibilité. C'est ma toile pour l'art numérique."
      },
      {
        "name": "Css",
        "description": "CSS !!, mon compagnon de conception, renforce mon parcours frontend. En tant que développeur en herbe, j'exploite sa magie pour donner vie au HTML et créer des sites Web visuellement époustouflants. C'est ma toile de création, qui façonne les mises en page, les styles et assure la réactivité. Avec CSS, je transforme le code en expériences utilisateur captivantes, un pixel à la fois."
      },
      {
        "name": "SASS",
        "description": "Sass, modularise le CSS ou du moins c'est comme ça que je le vois. En tant que développeur frontend, j'utilise Sass pour rationaliser le CSS, le rendant plus efficace et maintenable. C'est ma boîte à outils pour l'imbrication, les variables et les mixins. Avec Sass, je code plus intelligemment et je style plus audacieux."
      },
      {
        "name": "Tailwindcss",
        "description": "Tailwind CSS, mon allié de productivité, révolutionne le travail frontend. En tant que développeur en herbe, je m'appuie sur l'approche utilitaire de Tailwind pour un prototypage rapide et un code propre. Cela simplifie le style et augmente l'efficacité, me permettant de créer facilement des sites Web. Mon option préférée pour le style."
      },
      {
        "name": "Styled Components",
        "description": "Ce site a été construit à l'aide d'un composant stylisé. En tant que développeur junior, j'apprécie son pouvoir de styliser les composants React avec des littéraux de modèles balisés. C'est ma voie vers les styles encapsulés, la réutilisabilité et une base de code plus organisée."
      },
      {
        "name": "MUI",
        "description": "Material-UI (MUI), mon accélérateur de conception, amplifie mes capacités frontend. En tant que développeur en herbe, j'exploite les composants et les thèmes de MUI pour créer des applications React intuitives et esthétiques. Il simplifie le développement de l'interface utilisateur, améliore la cohérence et me permet de créer sans effort des interfaces utilisateur époustouflantes. Material-UI : où la fonctionnalité rencontre l'élégance dans la conception Web."
      },
      {
        "name": "Javascript",
        "description": "JavaScript, mon défi d'apprentissage, alimente mes aspirations frontend. En tant que développeur junior, je m'attaque à ses subtilités pour créer des expériences Web interactives. C'est mon langage de script pour la manipulation du DOM, l'ajout de fonctionnalités et l'amélioration des interactions utilisateur. Avec de la patience et de la pratique, je deviens un codeur plus confiant et plus compétent dans le monde de JavaScript."
      },
      {
        "name": "Typescript",
        "description": "TypeScript, mon mentor en codage, guide mon parcours frontend. En tant que développeur junior, j'utilise son typage puissant et son analyse statique pour écrire du JavaScript plus sûr et plus maintenable. C'est mon bouclier contre les erreurs d'exécution, m'aidant à créer des applications robustes et évolutives. TypeScript est mon pont pour devenir un codeur plus confiant et plus efficace."
      },
      {
        "name": "React",
        "description": "React.js, ma muse du développement, alimente mes ambitions frontend. En tant que développeur junior, j'exploite l'architecture basée sur les composants de React pour créer des interfaces utilisateur interactives et réactives. C'est ma boîte à outils pour créer des applications Web dynamiques, simplifier la gestion des états et améliorer les performances de l'interface utilisateur. Avec React.js, le développement frontend devient intuitif."
      }
    ],
    "workflow": [
      {
        "name": "Figma",
        "description": "Figma, mon pont conception-code, révolutionne mon parcours frontend. En tant que développeur, les fonctionnalités collaboratives de Figma m'aident à traduire de manière transparente les visions des concepteurs en code. C'est mon canevas pour inspecter les mises en page, exporter les ressources et garantir des implémentations parfaites au pixel près. Avec Figma, je comble le fossé entre concepteur et développeur avec précision et efficacité."
      },
      {
        "name": "Adobe xd",
        "description": "Adobe XD, mon catalyseur de conception à code, révolutionne ma collaboration front-end. Bien que je ne sois pas concepteur, j'utilise XD pour décortiquer les conceptions et les traduire en code fonctionnel. Il favorise le travail d'équipe, rationalise les transferts et garantit la fidélité de la conception dans le processus de développement. Adobe XD : reliez facilement la conception et le code pour un flux de travail harmonieux."
      },
      {
        "name": "Photoshop",
        "description": "Photoshop, ma toile numérique, renforce mes prouesses créatives. Avec lui, je répare en toute transparence des photos, crée des collages et retouche les images à la perfection. C'est ma boîte à outils pour transformer des idées en chefs-d'œuvre visuels, libérant ainsi mon potentiel artistique. Photoshop : là où l'imagination rencontre la précision, me permettant de donner vie aux visions."
      },
      {
        "name": "Illustrator",
        "description": "Adobe Illustrator, mon terrain de jeu créatif, alimente ma passion pour la création de logos et le dessin animé. C'est l'outil ultime pour créer des logos complexes avec précision et donner vie aux personnages avec des lignes et des couleurs expressives. Illustrator est l’endroit où ma vision artistique s’épanouit, transformant les concepts en visuels emblématiques."
      },
      {
        "name": "Git",
        "description": "Git, mon maestro du contrôle de version, façonne mon parcours de codage. En tant que développeur, j'apprécie la puissance de Git pour suivre les modifications, collaborer de manière transparente et maintenir l'intégrité du code. C'est ma protection contre le chaos, garantissant la stabilité du projet et permettant l'harmonie des équipes dans le monde du codage. Git : là où l'historique du code rencontre la collaboration, faisant du développement logiciel un jeu d'enfant."
      },
      {
        "name": "Github",
        "description": "GitHub, mon hub communautaire de codage, améliore mes efforts de développement. En tant que développeur, j'utilise GitHub pour héberger, collaborer et partager du code avec une communauté mondiale. C'est ma plateforme pour les contributions open source, la présentation de projets et la promotion de la collaboration. GitHub : là où le code rencontre la collaboration, élevant mon parcours de codage."
      },
      {
        "name": "Lightroom",
        "description": "Lightroom, mon paradis photographique, transforme mes images en chefs-d'œuvre visuels. Que je modifie, améliore ou organise, c'est ma boîte à outils pour donner vie à mes photos. Les fonctionnalités intuitives et les préréglages de Lightroom simplifient le processus, me permettant de libérer tout le potentiel de ma photographie sans effort."
      }
    ]
  },
  "formModal": {
    "header": "CONTACTEZ MOI",
    "text": "Voulez-vous démarrer un projet. Appelez-moi au +2348087411750, j'aimerais avoir de vos nouvelles.",
    "btn": "Envoyer Le Message",
    "name-placeholder": "Votre Nom",
    "email-placeholder": "Votre E-mail",
    "message-placeholder": "Votre Message"
  }
}
