{
  "typed": {
    "t1": "Mai ban sha'awa.",
    "t2": "Mai sha'awar Fasaha.",
    "t3": "Abubuwan da aka bayar na Blockchain Dev.",
    "t4": "Bude don koyan sabbin fasahohi.",
    "t5": "Frontend Dev."
  },
  "homePage": {
    "greet": "Sannu, ni ",
    "aboutText": "Game da",
    "heroText": "Barka dai, ni mai haɓaka tambarin gaba ne, mai tsara tambari kuma editan hoto a Jos, Najeriya. Ƙaunar faɗaɗa ilimi da ƙwarewa",
    "exploreBtn": "Bincika"
  },

  "nav": {
    "home": "Gida",
    "resume": "Ci gaba",
    "works": "Ayyuka",
    "about": "Game da",
    "tools": "Kayan aiki"
  },
  "aboutPage": {
    "description": "Sannu,",
    "brief": "Ni Victor Umeokoli ne ko Umeh a takaice zama a Jos, jihar Filato Najeriya",
    "skills": "Ni mai haɓakawa ne na gaba, tambari & vector mai ƙira mai haɓaka blockchain tare da ƙwarewar shekaru 3 a matsayin editan daukar hoto.",
    "hobby": "Abubuwan sha'awa",
    "hobbyDesc": "Ina son yin yawo, karanta litattafan almara da na ban dariya koyan sabbin abubuwa da ke jan hankalina ko na aiki. A lokacin hutuna ina kallon ƙwallon ƙafa ko anime.",
    "skillsList": "Ƙwarewar fasaha na da kayan aikin da nake aiki da su sune HTML, CSS, tailwindcss, SASS, kayan da aka tsara, git, Javascript, Typescript, Figma, Adobe XD, Photoshop, Illustrator, Lightroom da sauransu ......."
  },
  "resumePage": {
    "header": "RESUME",
    "address": {
      "1": "Victor Onyeka Umeokoli",
      "2": "Kasa, jihohin Filato. Najeriya",
      "3": "victorumeh196@gmail.com",
      "4": "(+234) 8087411750"
    },
    "objective": {
      "header": "Manufar",
      "body": "Ƙaunar mai haɓakawa da sha'awar gaba, ƙirƙirar aikace-aikacen gidan yanar gizo mai jan hankali, hulɗa da mai amfani. Haɓaka fassara ƙirar UI/UX zuwa hanyoyin sadarwa masu aiki da amsa yayin ci gaba da sabuntawa tare da sabbin hanyoyin ci gaban yanar gizo da fasaha. Neman ƙaramin matakin ci gaban gaba a kamfanin fasaha mai tunani na gaba."
    },
    "experience": {
      "header": "Kwarewar Ƙwararru",
      "section1": {
        "comp": "Amono Digital Studios",
        "role": "Editan Hoto da Mai bugawa",
        "text": "Kamfanin buga hoto da ke samar da dijital, kayan aikin hoto da ayyukan bugu ga masu daukar hoto da daidaikun mutane a garin Jos, jihar Filato a Najeriya. Juni 2018 - Dec 2020"
      },
      "section2": {
        "comp": "Photo World",
        "role": "Babban Editan Hoto da Fita",
        "text": "Jan 2021 - Faburairu 2022 Wani kamfani ne mai daukar hoto da kuma kamfanin buga hotuna da ke samar da dijital, daukar hoto, hada hotuna da ayyukan bugu ga masu daukar hoto da daidaikun mutane a Jos, jihar Filato ta Najeriya."
      }
    },
    "education": {
      "header": "Ilimi",
      "details": {
        "1": "Trinity Model Secondary School - Anambra - Jan 2012 - Dec 2013",
        "2": "St Stephen Secondary School - Anambra - Jan 2014 - Dec 2015",
        "3": "New Dominion Comprehensive School - Plateau - Jun 2015 - Dec 2017"
      }
    },
    "skills": {
      "softSkills": {
        "header": "Dabarun Dabaru",
        "skills": [
          "Ƙwararrun Ƙwararru",
          "Hankali ga Dalla-dalla",
          "Magance Matsala",
          "Sadarwa",
          "Aiki tare",
          "Daidaitawa"
        ]
      },
      "hardSkills": {
        "header": "Ƙwarewar Ƙwararru",
        "skills": [
          "HTML",
          "CSS",
          "Zane Mai Amsa",
          "Tailwindcss",
          "SASS",
          "MUI",
          "Styled Components",
          "Javascript",
          "Typescript",
          "React",
          "Redux",
          "API ɗin Context",
          "FIgma",
          "Adobe XD",
          "Git",
          "Github",
          "Adobe Photoshop"
        ]
      }
    }
  },
  "toolsPage": {
    "header": "Waɗannan su ne wasu kayan aikin da nake amfani da su, don ƙira, inganta hotuna da haɓakawa. A koyaushe ina buɗe don koyon sabbin fasahohin da ake buƙata don aikin.",
    "frontend": [
      {
        "name": "HTML",
        "description": "HTML shine ginshiƙi na a matsayin mai haɓaka gaba. Tare da shi, Ina ƙera abubuwan da ke jan hankalin gidan yanar gizo, tsara abun ciki, da tabbatar da samun dama. Canvas na ne don fasahar dijital."
      },
      {
        "name": "Css",
        "description": "CSS!!, Abokin ƙira na, yana ƙarfafa tafiya ta gaba. A matsayina na mai haɓakawa, Ina amfani da sihirinsa don hura rayuwa cikin HTML, ƙirƙirar gidajen yanar gizo masu ban sha'awa na gani. Yana da zane mai ƙirƙira, tsara shimfidu, salo, da kuma tabbatar da amsawa. Tare da CSS, Ina canza lamba zuwa gogewar mai amfani, pixel ɗaya a lokaci guda."
      },
      {
        "name": "SASS",
        "description": "Sass, yana daidaita CSS ko aƙalla haka nake gani. A matsayina na mai haɓakawa na gaba, Ina amfani da Sass don daidaita CSS, yana mai da shi mafi inganci da kiyayewa. Kayan aikina ne na gida, masu canji, da mixins. Tare da Sass, Na ƙididdige wayo da salo mai ƙarfi."
      },
      {
        "name": "Tailwindcss",
        "description": "Tailwind CSS, abokin aikina, yana canza aikin gaba. A matsayina na mai haɓakawa, na dogara da tsarin amfani na Tailwind-farko don saurin samfuri da tsaftataccen lamba. Yana sauƙaƙa salo da haɓaka inganci, yana ba ni damar gina gidajen yanar gizo cikin sauƙi. Zaɓin da na fi so don salo."
      },
      {
        "name": "Styled Components",
        "description": "An gina wannan rukunin yanar gizon ta amfani da sassa masu salo. A matsayina na ƙarami mai haɓakawa, Na rungumi ikon sa don salon abubuwan gyara React tare da alamar ainihin samfuri. Hanyata ce zuwa salon da aka tattara, sake amfani da ita, da ingantaccen tsarin codebase."
      },
      {
        "name": "MUI",
        "description": "Material-UI (MUI), mai saurin ƙira na, yana haɓaka iyawar gabana. A matsayina na mai haɓaka haɓakawa, Ina amfani da abubuwan MUI da jigo don aikace-aikacen React masu daɗaɗɗa da fahimta. Yana sauƙaƙa ci gaban UI, yana haɓaka daidaito, kuma yana ba ni iko don ƙirƙirar mu'amala mai ban sha'awa ba tare da wahala ba. Material-UI: inda ayyuka suka hadu da kyan gani a ƙirar gidan yanar gizo."
      },
      {
        "name": "Javascript",
        "description": "JavaScript, ƙalubalen koyo na, yana ƙara rura wutar buri na na gaba. A matsayina na ƙarami mai haɓakawa, na yi gwagwarmaya tare da ƙaƙƙarfan sa don ƙirƙirar ƙwarewar yanar gizo mai ma'amala. Yaren rubutuna ne don sarrafa DOM, ƙara ayyuka, da haɓaka hulɗar mai amfani. Tare da haƙuri da aiki, Ina girma zuwa mafi kwarin gwiwa da iya coder a duniyar JavaScript."
      },
      {
        "name": "Typescript",
        "description": "TypeScript, mai ba da shawara na lamba, yana jagorantar tafiya ta gaba. A matsayina na ƙarami mai haɓakawa, na rungumi ƙaƙƙarfan bugunsa da bincike a tsaye don rubuta JavaScript mafi aminci da kiyayewa. Garkuwata ce daga kurakuran lokacin aiki, yana taimaka mini gina ƙaƙƙarfan aikace-aikace masu ƙarfi. TypeScript shine gada na don zama mafi ƙarfin gwiwa da ingantaccen coder."
      },
      {
        "name": "React",
        "description": "React.js, kayan tarihi na ci gaba, yana ba da ikon buri na na gaba. A matsayina na ƙarami mai haɓakawa, Ina yin amfani da tsarin gine-gine na tushen React don ƙera mu'amalar mu'amala da mu'amalar mai amfani. Kayan aikina ne don gina aikace-aikacen gidan yanar gizo masu ƙarfi, sauƙaƙe gudanarwar jiha, da haɓaka aikin UI. Tare da React.js, ci gaban gaba ya zama mai hankali."
      }
    ],
    "workflow": [
      {
        "name": "Figma",
        "description": "Figma, gada na ƙira-zuwa-ladi, yana canza tafiya ta gaba. A matsayina na haɗin gwiwar mai haɓaka figma yana taimaka mani fassara hangen nesa na masu ƙira zuwa lamba. Yana da zane na don bincika shimfidu, fitar da kadarori, da tabbatar da ingantaccen aiwatarwa. Tare da Figma, Na haɗu da gibin ƙira-mai haɓaka tare da daidaito da inganci."
      },
      {
        "name": "Adobe xd",
        "description": "Adobe XD, ƙirar ƙira-zuwa-ladi na, yana kawo sauyi na haɗin gwiwa na gaba. Ko da yake ba mai zane ba ne, Ina amfani da XD don rarraba ƙira da fassara su zuwa lambar aiki. Yana haɓaka aikin haɗin gwiwa, daidaita ayyukan hannu, kuma yana tabbatar da amincin ƙira a cikin tsarin ci gaba. Adobe XD: haɓaka ƙira da lamba ba tare da matsala ba don tafiyar aiki mai jituwa."
      },
      {
        "name": "Photoshop",
        "description": "Photoshop, zane na dijital, yana ba da ƙarfin ƙirƙira ta. Da shi, Ina gyara hotuna ba tare da wata matsala ba, ƙwararrun ƙwararrun sana'a, da sake kunna hotuna zuwa kamala. Akwatin kayan aiki na ne don canza ra'ayoyi zuwa ƙwararrun gani, tare da buɗe damar fasaha ta. Photoshop: inda tunanin ya hadu da daidaito, yana ba ni damar kawo hangen nesa zuwa rayuwa."
      },
      {
        "name": "Illustrator",
        "description": "Adobe Illustrator, filin wasa na mai ƙirƙira, yana ƙara rura wutar sha'awar ƙirar tambari da zane mai ban dariya. Kayan aiki ne na ƙarshe don ƙirƙira tambura masu rikitarwa tare da madaidaici da kawo haruffa zuwa rayuwa tare da layukan bayyanawa da launuka. Mai zane shine inda hangen nesa na fasaha ya bunƙasa, yana mai da ra'ayoyi zuwa abubuwan gani."
      },
      {
        "name": "Git",
        "description": "Git, nau'ina mai sarrafa maestro, yana tsara tafiya ta coding. A matsayina na mai haɓakawa, na rungumi ikon Git don bin diddigin canje-canje, yin haɗin gwiwa ba tare da wata matsala ba, da kiyaye amincin lambar. Yana da kariyata daga hargitsi, tabbatar da kwanciyar hankali na aiki da ba da damar jituwa ta ƙungiyar a duniyar coding. Git: inda tarihin lambar ya hadu da haɗin gwiwa, yana sa haɓaka software ya zama iska."
      },
      {
        "name": "Github",
        "description": "GitHub, my coding community hub, enhances my development endeavors. As a developer, I utilize GitHub to host, collaborate, and share code with a global community. It's my platform for open-source contributions, showcasing projects, and fostering collaboration. GitHub: where code meets collaboration, elevating my coding journey."
      },
      {
        "name": "Lightroom",
        "description": "Lightroom, wurin daukar hoto na, yana canza hotuna na zuwa manyan abubuwan gani. Ko ina gyarawa, haɓakawa, ko tsarawa, kayan aikina ne don kawo hotuna zuwa rayuwa. Siffofin ilhama na Lightroom da saitattun saiti suna sauƙaƙe aikin, suna ba ni damar buɗe cikakkiyar damar ɗaukar hoto na ba tare da wahala ba."
      }
    ]
  },
  "formModal": {
    "header": "TUNTUBE NI",
    "text": "Kuna so ku fara aiki. A ba ni kira +2348087411750, zan so in ji daga gare ku.",
    "btn": "Aika Saƙo",
    "name-placeholder": "Sunan ku",
    "email-placeholder": "Imel ɗin ku",
    "message-placeholder": "Sakon ku"
  }
}
