{
  "typed": {
    "t1": "Adventurer.",
    "t2": "Tech iyaragaga.",
    "t3": "Aspiring Blockchain Dev.",
    "t4": "Ṣi si kikọ awọn imọ-ẹrọ tuntun.",
    "t5": "Frontend Dev."
  },
  "homePage": {
    "greet": "Hi, Emi ni ",
    "aboutText": "Nipa",
    "heroText": "Bawo, Emi jẹ olupilẹṣẹ iwaju, oluṣe apẹẹrẹ ati olootu fọto ni Jos, Nigeria. Ni itara lati faagun imọ ati awọn ọgbọn",
    "exploreBtn": "Ye"
  },

  "nav": {
    "home": "Ile",
    "resume": "Tun bẹrẹ",
    "works": "Awọn iṣẹ",
    "about": "Nipa",
    "tools": "Awọn irinṣẹ"
  },
  "aboutPage": {
    "description": "Iwo ti o wa nibe yen,",
    "brief": "Emi ni Victor Umeokoli tabi Umeh fun gbigbe kukuru ni Jos, Plateau state Nigeria",
    "skills": "Mo jẹ olupilẹṣẹ iwaju, aami ati apẹẹrẹ vector ti o nireti idagbasoke blockchain pẹlu ọdun 3 ti iriri bi olootu fọtoyiya.",
    "hobby": "Awọn iṣẹ aṣenọju",
    "hobbyDesc": "Mo nifẹ irin-ajo, kika itan-akọọlẹ ati awọn iwe apanilerin kikọ awọn ohun tuntun ti o mu iwulo mi tabi ti o jẹ fun iṣẹ.Ni akoko isinmi mi Mo wo bọọlu afẹsẹgba tabi awọn ere idaraya.",
    "skillsList": "Awọn ọgbọn imọ-ẹrọ mi ati awọn irinṣẹ ti Mo ṣiṣẹ pẹlu HTML, CSS, tailwindcss, SASS, awọn paati ara-ara, git, Javascript, Typescript, Figma, Adobe XD, Photoshop, Illustrator, Lightroom ati awọn miiran ......"
  },
  "resumePage": {
    "header": "RESUME",
    "address": {
      "1": "Victor Onyeka Umeokoli",
      "2": "Jos, plateau state. Nigeria",
      "3": "victorumeh196@gmail.com",
      "4": "(+234) 8087411750"
    },
    "objective": {
      "header": "Idi",
      "body": "Ifiṣootọ ati olupilẹṣẹ ti o ni itara iwaju, ṣiṣẹda ikopa, ibaraenisepo ati awọn ohun elo wẹẹbu-centric olumulo. Adept ni titumọ awọn aṣa UI/UX sinu iṣẹ-ṣiṣe ati awọn oju-ọna idahun lakoko ti o wa ni imudojuiwọn pẹlu awọn aṣa idagbasoke wẹẹbu tuntun ati imọ-ẹrọ. Wiwa ipa idagbasoke iwaju iwaju ipele junior ni ile-iṣẹ imọ-ẹrọ iwaju-ero."
    },
    "experience": {
      "header": "Ọjọgbọn Iriri",
      "section1": {
        "comp": "Amono Digital Studios",
        "role": "Olootu Fọto ati itẹwe",
        "text": "Ile-iṣẹ titẹ fọto ti n pese oni-nọmba, awọn imudara fọto ati awọn iṣẹ titẹ sita fun awọn oluyaworan ati awọn eniyan kọọkan ni Jos, ipinlẹ Plateau Nigeria. Oṣu Kẹta ọdun 2018 - Oṣu kejila ọdun 2020"
      },
      "section2": {
        "comp": "Photo World",
        "role": "Olootu Fọto Agba ati itẹwe",
        "text": "Jan 2021 - Oṣu kejila 2022 Ile-iṣere fọtograghy ​​kan ati ile-iṣẹ titẹjade fọto ti n pese oni nọmba, titu fọto, awọn imudara fọto ati awọn iṣẹ titẹ fun awọn oluyaworan ati awọn eniyan kọọkan ni Jos, ipinlẹ Plateau Nigeria."
      }
    },
    "education": {
      "header": "Ẹkọ",
      "details": {
        "1": "Trinity Model Secondary School - Anambra - Jan 2012 - Dec 2013",
        "2": "St Stephen Secondary School - Anambra - Jan 2014 - Dec 2015",
        "3": "New Dominion Comprehensive School - Plateau - Jun 2015 - Dec 2017"
      }
    },
    "skills": {
      "softSkills": {
        "header": "Awọn Ogbon Asọ",
        "skills": [
          "Awọn ọgbọn ti ara ẹni",
          "Ifojusi si Apejuwe",
          "Yanju isoro",
          "Ibaraẹnisọrọ",
          "Ise Egbe",
          "Imudaramu"
        ]
      },
      "hardSkills": {
        "header": "lile ogbon",
        "skills": [
          "HTML",
          "CSS",
          "Oniru idahun",
          "Tailwindcss",
          "SASS",
          "MUI",
          "Styled Component",
          "Javascript",
          "Typescript",
          "React",
          "Redux",
          "Context API",
          "FIgma",
          "Adobe XD",
          "Git",
          "Github",
          "Adobe Photoshop"
        ]
      }
    }
  },
  "toolsPage": {
    "header": "Iwọnyi jẹ diẹ ninu awọn irinṣẹ ti Mo lo, fun apẹrẹ, iṣapeye awọn aworan ati idagbasoke",
    "frontend": [
      {
        "name": "HTML",
        "description": "HTML jẹ okuta igun mi bi olupilẹṣẹ iwaju. Pẹlu rẹ, Mo ṣiṣẹ awọn iriri oju opo wẹẹbu iyanilẹnu, akoonu igbekalẹ, ati rii daju iraye si. O jẹ kanfasi mi fun iṣẹ ọna oni-nọmba."
      },
      {
        "name": "Css",
        "description": "CSS!!, ẹlẹgbẹ apẹrẹ mi, n fun irin-ajo iwaju mi ​​ni agbara. Gẹ́gẹ́ bí olùgbéejáde ìdàgbàsókè, Mo máa ń lo idan rẹ̀ láti mí ìgbésí-ayé sí HTML, ní ṣíṣe àwọn ojúlé wẹ́ẹ̀bù tí ó wúni lórí. O jẹ kanfasi iṣẹda mi, awọn apẹrẹ ti n ṣatunṣe, awọn aza, ati idaniloju idahun. Pẹlu CSS, Mo yi koodu pada si awọn iriri olumulo iyanilẹnu, ẹbun kan ni akoko kan."
      },
      {
        "name": "SASS",
        "description": "Sass, modularizes CSS tabi o kere ju iyẹn ni MO ṣe rii. Gẹgẹbi olupilẹṣẹ iwaju, Mo lo Sass lati mu CSS ṣiṣẹ, ti o jẹ ki o munadoko diẹ sii ati ṣetọju. O jẹ ohun elo irinṣẹ mi fun itẹ-ẹiyẹ, awọn oniyipada, ati awọn apopọ. Pẹlu Sass, Mo koodu ijafafa ati igboya ara."
      },
      {
        "name": "Tailwindcss",
        "description": "Tailwind CSS, ọrẹ-iṣẹ iṣelọpọ mi, ṣe iyipada iṣẹ iwaju. Gẹgẹbi olupilẹṣẹ idagbasoke, Mo gbẹkẹle IwUlO Tailwind-ọna akọkọ fun ṣiṣe adaṣe iyara ati koodu mimọ. O simplifies iselona ati igbelaruge ṣiṣe, gbigba mi lati kọ awọn aaye ayelujara pẹlu Ease. Aṣayan ayanfẹ mi fun iselona."
      },
      {
        "name": "Styled Components",
        "description": "Yi ojula ti a še nipa lilo styled paati. Gẹgẹbi olupilẹṣẹ ọdọ, Mo gba agbara rẹ si ara awọn paati React pẹlu awọn awoṣe ti a samisi. O jẹ ipa-ọna mi si awọn aza ti a fi kun, atunlo, ati koodu koodu ti o ṣeto diẹ sii."
      },
      {
        "name": "MUI",
        "description": "Material-UI (MUI), ohun imuyara apẹrẹ mi, nmu awọn agbara iwaju iwaju mi ​​pọ si. Gẹgẹbi olupilẹṣẹ ti o dagba, Mo nfi awọn ohun elo MUI ṣe ati akori fun awọn ohun elo ti o ni imọran, ti o dara julọ ti o ṣe itẹwọgbà React. O mu ki idagbasoke UI rọrun, mu aitasera, o si fun mi ni agbara lati ṣẹda ohun iyanu awọn atọkun olumulo lainidi ohun elo-UI: nibiti iṣẹ ṣiṣe pade didara ni apẹrẹ wẹẹbu."
      },
      {
        "name": "Javascript",
        "description": "JavaScript, ipenija ẹkọ mi, n ṣe awọn ireti iwaju iwaju mi. Gẹgẹbi olupilẹṣẹ ọdọ, Mo koju pẹlu awọn intricacies rẹ lati ṣẹda awọn iriri wẹẹbu ibaraenisepo. O jẹ ede iwe afọwọkọ mi fun ifọwọyi DOM, fifi iṣẹ ṣiṣe kun, ati imudara awọn ibaraẹnisọrọ olumulo. Pẹlu sũru ati adaṣe, Mo n dagba si igbẹkẹle diẹ sii ati coder ti o lagbara ni agbaye ti JavaScript."
      },
      {
        "name": "Typescript",
        "description": "TypeScript, olutọran ifaminsi mi, ṣe itọsọna irin-ajo iwaju mi. Gẹgẹbi olupilẹṣẹ ọdọ, Mo gba titẹ agbara rẹ ati itupalẹ aimi lati kọ ailewu ati JavaScript ti o le ṣetọju diẹ sii. O jẹ apata mi lodi si awọn aṣiṣe akoko asiko, o ṣe iranlọwọ fun mi lati kọ awọn ohun elo to lagbara ati iwọn. TypeScript jẹ afara mi lati di igboya diẹ sii ati coder daradara."
      },
      {
        "name": "React",
        "description": "React.js, muse idagbasoke mi, ṣe agbara awọn ireti iwaju mi. Gẹ́gẹ́ bí olùgbéjáde kékeré kan, mo máa ń lo ìtumọ̀ ìpìlẹ̀ ìpìlẹ̀ àkópọ̀ èròjà React si iṣẹ́ ọnà ìbánisọ̀rọ̀ àti àwọn atọ́nà oníṣe ìdáhùn. O jẹ ohun elo irinṣẹ mi fun kikọ awọn ohun elo wẹẹbu ti o ni agbara, mimu iṣakoso ipinlẹ dirọ, ati imudara iṣẹ UI. Pẹlu React.js, idagbasoke iwaju di ogbon inu."
      }
    ],
    "workflow": [
      {
        "name": "Figma",
        "description": "Figma, Afara apẹrẹ-si-koodu, ṣe iyipada irin-ajo iwaju iwaju mi. Gẹgẹbi awọn ẹya ifọwọsowọpọ figma olupilẹṣẹ ṣe iranlọwọ fun mi lainidi lati tumọ awọn iran awọn apẹẹrẹ sinu koodu. O jẹ kanfasi mi fun iṣayẹwo awọn ipalemo, gbigbejade dukia, ati idaniloju awọn imuse pipe-pipe. Pẹlu Figma, Mo di aafo-apẹrẹ-apẹrẹ pẹlu konge ati ṣiṣe."
      },
      {
        "name": "Adobe xd",
        "description": "Adobe XD, ayase oniru-si-koodu, ṣe iyipada ifowosowopo iwaju mi. Botilẹjẹpe kii ṣe apẹẹrẹ, Mo lo XD lati pin awọn apẹrẹ ati tumọ wọn sinu koodu iṣẹ. O ṣe atilẹyin iṣẹ-ṣiṣe ẹgbẹ, ṣe atunṣe awọn ọwọ, ati idaniloju iṣotitọ apẹrẹ ni ilana idagbasoke. Adobe XD: Asopọmọra apẹrẹ ati koodu lainidi fun iṣan-iṣẹ irẹpọ kan."
      },
      {
        "name": "Photoshop",
        "description": "Photoshop, kanfasi oni-nọmba mi, n fun agbara iṣẹda mi lagbara. Pẹlu rẹ, Mo tun awọn fọto ṣe lainidi, awọn akojọpọ iṣẹ ọwọ, ati tun awọn aworan ṣe si pipe. O jẹ apoti irinṣẹ mi fun iyipada awọn imọran si awọn afọwọṣe wiwo, ṣiṣafihan agbara iṣẹ ọna mi. Photoshop: nibiti oju inu ba pade pipe, ti n fun mi laaye lati mu awọn iran wa si igbesi aye."
      },
      {
        "name": "Illustrator",
        "description": "Adobe Illustrator, ibi-iṣere iṣẹda ti o ṣẹda, nmu ifẹkufẹ mi fun apẹrẹ aami ati aworan ere. O jẹ ohun elo ti o ga julọ fun ṣiṣe awọn aami intricate pẹlu konge ati mimu awọn kikọ wa si igbesi aye pẹlu awọn laini asọye ati awọn awọ. Oluyaworan ni ibi ti iran iṣẹ ọna mi ti gbilẹ, titan awọn imọran sinu awọn iwo alakan."
      },
      {
        "name": "Git",
        "description": "Git, maestro iṣakoso ẹya mi, ṣe apẹrẹ irin-ajo ifaminsi mi. Gẹgẹbi olupilẹṣẹ, Mo gba agbara Git lati tọpa awọn ayipada, ṣe ifowosowopo lainidi, ati ṣetọju iduroṣinṣin koodu. O jẹ aabo mi lodi si rudurudu, aridaju iduroṣinṣin iṣẹ akanṣe ati mimuuṣiṣẹpọ ẹgbẹ ni agbaye ti ifaminsi. Git: nibiti itan-akọọlẹ koodu pade ifowosowopo, ṣiṣe idagbasoke sọfitiwia jẹ afẹfẹ."
      },
      {
        "name": "Github",
        "description": "GitHub, ibudo agbegbe ifaminsi mi, mu awọn igbiyanju idagbasoke mi pọ si. Gẹgẹbi olupilẹṣẹ, Mo lo GitHub lati gbalejo, ṣe ifowosowopo, ati pin koodu pẹlu agbegbe agbaye kan. O jẹ pẹpẹ mi fun awọn ilowosi orisun-ìmọ, iṣafihan awọn iṣẹ akanṣe, ati imudara ifowosowopo. GitHub: nibiti koodu ti pade ifowosowopo, igbega irin-ajo ifaminsi mi."
      },
      {
        "name": "Lightroom",
        "description": "Lightroom, ibi aabo aworan mi, yi awọn aworan mi pada si awọn afọwọṣe wiwo. Boya Mo n ṣatunkọ, imudara, tabi ṣeto, ohun elo irinṣẹ mi ni fun mimu awọn fọto wa si aye. Awọn ẹya ogbon inu Lightroom ati awọn tito tẹlẹ jẹ ki ilana naa rọrun, gbigba mi laaye lati ṣii agbara kikun ti fọtoyiya mi lainidi."
      }
    ]
  },

  "formModal": {
    "header": "Kan si MI",
    "text": "Ṣe o fẹ lati bẹrẹ ise agbese kan. Fun mi ni ipe +2348087411750, Emi yoo fẹ lati gbọ lati ọdọ rẹ.",
    "btn": "Firanṣẹ Ifiranṣẹ",
    "name-placeholder": "Orukọ rẹ",
    "email-placeholder": "Imeeli rẹ",
    "message-placeholder": "Ifiranṣẹ rẹ"
  }
}
